#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-9bj8d1n52KqhVyTh

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/726.7c7cb641.chunk.js.map"]: Refreshing state... [id=static/js/726.7c7cb641.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js"]: Refreshing state... [id=static/js/150.5291fc9d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.9af64110.chunk.js"]: Refreshing state... [id=static/js/106.9af64110.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js.map"]: Refreshing state... [id=static/js/150.5291fc9d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/231.2b5285c2.chunk.js.map"]: Refreshing state... [id=static/js/231.2b5285c2.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.6b12bb7f.chunk.js"]: Refreshing state... [id=static/js/496.6b12bb7f.chunk.js]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js"]: Refreshing state... [id=static/js/924.883baa43.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.9af64110.chunk.js.map"]: Refreshing state... [id=static/js/106.9af64110.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/main.7c8da9df.css.map"]: Refreshing state... [id=static/css/main.7c8da9df.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js"]: Refreshing state... [id=static/js/main.4a8bbbcf.js]
module.web.aws_s3_object.upload_webapp["static/css/main.7c8da9df.css"]: Refreshing state... [id=static/css/main.7c8da9df.css]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js.map"]: Refreshing state... [id=static/js/924.883baa43.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/231.e92e574f.chunk.css"]: Refreshing state... [id=static/css/231.e92e574f.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js.map"]: Refreshing state... [id=static/js/main.4a8bbbcf.js.map]
module.web.aws_s3_object.upload_webapp["static/js/726.7c7cb641.chunk.js"]: Refreshing state... [id=static/js/726.7c7cb641.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.dc23ef38.chunk.js.map"]: Refreshing state... [id=static/js/777.dc23ef38.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/150.5291fc9d.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/496.6b12bb7f.chunk.js.map"]: Refreshing state... [id=static/js/496.6b12bb7f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.dc23ef38.chunk.js"]: Refreshing state... [id=static/js/777.dc23ef38.chunk.js]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/css/231.e92e574f.chunk.css.map"]: Refreshing state... [id=static/css/231.e92e574f.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/231.2b5285c2.chunk.js"]: Refreshing state... [id=static/js/231.2b5285c2.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.4a8bbbcf.js.LICENSE.txt]
module.web.aws_cloudfront_distribution.jowe_web: Drift detected (update)
module.web.aws_cloudfront_origin_access_identity.jowe_web: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/106.9af64110.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/main.7c8da9df.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/726.7c7cb641.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/main.7c8da9df.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/777.dc23ef38.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/106.9af64110.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/231.2b5285c2.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/924.883baa43.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/496.6b12bb7f.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/231.e92e574f.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["manifest.json"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/726.7c7cb641.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/231.e92e574f.chunk.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/777.dc23ef38.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/496.6b12bb7f.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/231.2b5285c2.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["index.html"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/150.5291fc9d.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_cloudfront_distribution.jowe_web will be updated in-place
  ~ resource "aws_cloudfront_distribution" "jowe_web" {
      ~ http_version                   = "http2and3" -> "http2"
        id                             = "E36U11KHAWUB2P"
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-web"
        }
        # (20 unchanged attributes hidden)

      ~ restrictions {
          ~ geo_restriction {
              ~ locations        = [
                  + "AT",
                  + "CH",
                  + "DE",
                  + "HR",
                  + "JP",
                  + "PH",
                  + "SI",
                ]
              ~ restriction_type = "none" -> "whitelist"
            }
        }

      ~ viewer_certificate {
          ~ minimum_protocol_version       = "TLSv1.2_2021" -> "TLSv1"
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "0c45c9d7dacaffa8528c0cc451b85f03" -> "7f733e7f43d5a3d9d84c6884f537c4c9"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "Xp__nZJzV0Yy2C8r9lva2ynDfjt1ql8O" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "117ccdb8a1e7b6df949fe38b3c92ae74" -> "37fd969bf2377a177d2474951753ce42"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "xQUzEEP29qRjUBnym3cA8y.6MgxORF4L" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js"] will be destroyed
  # (because key ["static/js/main.4a8bbbcf.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - arn                    = "arn:aws:s3:::jowe-dev.initialised.si/static/js/main.4a8bbbcf.js" -> null
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "7b9547f82fc4a040e597e6d988ee2b08" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.4a8bbbcf.js" -> null
      - key                    = "static/js/main.4a8bbbcf.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.4a8bbbcf.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "tzsZP4EG0I2CrbPy842KioKpDpxxB9nK" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.4a8bbbcf.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - arn                    = "arn:aws:s3:::jowe-dev.initialised.si/static/js/main.4a8bbbcf.js.LICENSE.txt" -> null
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "0dfb3bcd66799840da3462307af75820" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.4a8bbbcf.js.LICENSE.txt" -> null
      - key                    = "static/js/main.4a8bbbcf.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.4a8bbbcf.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "MfUzY5vBMu9g_pAkfdEOFcLLWF9CTa9n" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.4a8bbbcf.js.map"] will be destroyed
  # (because key ["static/js/main.4a8bbbcf.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - arn                    = "arn:aws:s3:::jowe-dev.initialised.si/static/js/main.4a8bbbcf.js.map" -> null
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "a4b778ed20c705193c1943d331556e8f" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.4a8bbbcf.js.map" -> null
      - key                    = "static/js/main.4a8bbbcf.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.4a8bbbcf.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Ob_aliRCc7fGgMNU5_3HJzneUdN3oNSg" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.f902673e.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "0c63bb7ecad8e734eac07b19122d85ab"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.f902673e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.f902673e.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.f902673e.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "a4e109a58d246f6b7164a9d46fbd5aff"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.f902673e.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.f902673e.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.f902673e.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "00ff6e77fc968e9ab3e35fe978812b1d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.f902673e.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.f902673e.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*